<?php
return [
    // 协议支付
    'fuiou_wap_config' => [
        "MCHNTCD"   => "0004910F2061736",  // 商户号
        "KEY"       => "xgwnu3gc3144rpopl4smoo09rv3za5ec",  // 密钥
        "TYPE"      => "10",  // 交易类型
        "VERSION"   => "2.0",
        "LOGOTP"    => "1", // 是否隐藏支付页面富友的logo，1-隐藏，0-显示
        "IDTYPE"    => "0", //证件类型，0-身份证
        "SIGNTP"    => "md5", //签名类型
        "ENCTP"     => "1", // 加密标志
        "GATEWAY"   => "https://mpay.fuioupay.com:16128/h5pay/payAction.pay",
    ],

    // 网银支付
    'fuiou_wy_config' => [
        "mchnt_cd"  => "0004910F2061736", //商户号
        "mchnt_key" => "s10iz363ygh6jd7lqvrkb6ljnl33mvqr", // 网关支付密钥
        "order_pay_type" => "B2C",
        "order_valid_time" => "10m", // 1m-15 天，m：分钟、h：小时、d 天、1c 当天有效
        "ver"       => "1.0.1",
        "gateway"   => "https://pay.fuioupay.com/smpGate.do",
    ],

    'fuiou_payment_config' => [
        "mchntcd"   => "0004910F2061736",
        "mchntkey"  => "gy6l1dmknztjdtdsinq3auts4wxov4av",
        "ver"       => "1.00",
        "reqtype"   => "payforreq",
        "gateway"   => "https://fht-api.fuioupay.com/req.do",
    ],

    // 网银支付,银行编码
    'wy_bank_code' => [
        '102' => "0801020000", //工商银行
        '103' => '0801030000', //中国农业银行
        '104' => '0801040000', //中国银行
        '105' => '0801050000', //建设银行
        '301' => '0803010000', //交通银行
        '303' => '0803030000', //光大银行
        '305' => '0803050000', //民生银行
        '310' => '0803100000', //浦发银行
        '403' => '0801000000', //中国邮储银行
        "中国工商银行" => '0801020000',
        "中国农业银行" => '0801030000',
        "中国银行" => '0801040000',
        "中国建设银行" => '0801050000',
        "交通银行" => '0803010000',
        "中信银行" => '0803020000',
        "中国光大银行" => '0803030000',
        "华夏银行"  => '0803040000',
        "中国民生银行" => '0803050000',
        "广东发展银行" => '0803060000',
        "招商银行" => '0803080000',
        "兴业银行" => '0803090000',
        "上海浦东发展银行" => '0803100000',
        "浙商银行" => '0803160000',
        "中国邮政储蓄银行" => '0801000000',
        "平安银行" => '0804105840',
        "杭州银行" => '0000000000',
        "北京银行" => '0804031000',
        "上海银行" => '080401001C'
    ],

    // 代付总行代码
    'payment_bank_no' => [
        "中国工商银行" => '0102',
        "中国农业银行" => '0103',
        "中国银行" => '0104',
        "中国建设银行" => '0105',
        "交通银行" => '0301',
        "中信银行" => '0302',
        "中国光大银行" => '0303',
        "华夏银行"  => '0304',
        "中国民生银行" => '0305',
        "广东发展银行" => '0306',
        "招商银行" => '0308',
        "兴业银行" => '0309',
        "上海浦东发展银行" => '0310',
        "浙商银行" => '0316',
        "中国邮政储蓄银行" => '0403',
        "平安银行" => '0307',
        "杭州银行" => '0313',
        "北京银行" => '0313',
        "上海银行" => '0313'
    ],
];